<?php
defined('MOODLE_INTERNAL') || die();

define('QTYPE_MULTIROWSWITCH_NUMBER_OF_ROWS', 3);
define('QTYPE_MULTIROWSWITCH_NUMBER_OF_COLUMNS', 2);

class MultiRowSwitchHelper
{
    private static $instance;

    public static $methodWithoutWeight = ['ito', 'shmisheka'];

    public static function getInstance()
    {
        if (self::$instance) {
            return self::$instance;
        }

        return new static();
    }

    public function getNumberOfRowsData()
    {
        return [
            'shmisheka' => 88,
            'ito' => 91,
        ];
    }

    function getNumberOfRows($type)
    {
        $types = getNumberOfRowsData();

        return isset($types[$type]) ? $types[$type] : 0;
    }

    public function getMethodDataPrepared($rows, $weights)
    {
        $weightsPrepared = [];
        foreach ($weights as $weightVariants) {
            foreach ($weightVariants as $weight) {
                if ($weight->weight > 0) {
                    $weightsPrepared[$weight->rownumber] = $weight->columnnumber;
                }
            }
        }
        $methodData = [];
        foreach ($rows as $row) {
            $methodData[] = [
                'text' => $row->optiontext,
                'checked' => isset($weightsPrepared[$row->number])? $weightsPrepared[$row->number] : 1,
            ];
        }

        return $methodData;
    }

    public function getMethodsDefaultData()
    {
        return [
            'ito' => [
                [
                    'number' => 1,
                    'text' => 'Я намагатимуся поставитися до дослідження відповідально і бути максимально щирим (щирою)',
                    'checked' => true,
                ],
                [
                    'number' => 2,
                    'text' => 'У мене дуже складний і важкий для оточуючих характер',
                    'checked' => true,
                ],
                [
                    'number' => 3,
                    'text' => 'Я краще справляюся з роботою в тиші й на самоті, ніж у присутності багатьох людей, або в галасливому місці',
                    'checked' => true,
                ],
                [
                    'number' => 4,
                    'text' => 'Вирішуючи серйозні проблеми, я, зазвичай, обходжуся без сторонньої допомоги',
                    'checked' => true,
                ],
                [
                    'number' => 5,
                    'text' => 'Я дуже рідко розпочну розмову першим (першою) з незнайомими людьми',
                    'checked' => true,
                ],
                [
                    'number' => 6,
                    'text' => 'Для мене важлива думка інших про мої висловлювання та вчинки',
                    'checked' => true,
                ],
                [
                    'number' => 7,
                    'text' => 'Якщо потрібно, я зруйную всі перепони на шляху до досягнення мети',
                    'checked' => true,
                ],
                [
                    'number' => 8,
                    'text' => 'Я часто непокоюся через дрібниці',
                    'checked' => true,
                ],
                [
                    'number' => 9,
                    'text' => 'У моїх невдачах винні певні люди',
                    'checked' => true,
                ],
                [
                    'number' => 10,
                    'text' => 'Для мене важливо мати спільну думку з тими людьми, з якими я, зазвичай, спілкуюся',
                    'checked' => true,
                ],
                [
                    'number' => 11,
                    'text' => 'Мене мало стосується все, що трапляється з іншими',
                    'checked' => true,
                ],
                [
                    'number' => 12,
                    'text' => 'Мені цікаві яскраві, артистичні особистості',
                    'checked' => true,
                ],
                [
                    'number' => 13,
                    'text' => 'Мені байдуже до чужих страждань: вистачає своїх',
                    'checked' => true,
                ],
                [
                    'number' => 14,
                    'text' => 'У галасливій компанії я найчастіше тільки спостерігач',
                    'checked' => true,
                ],
                [
                    'number' => 15,
                    'text' => 'Для мене нестерпно бачити страждання інших людей',
                    'checked' => true,
                ],
                [
                    'number' => 16,
                    'text' => 'Я людина абсолютно правдива і щира',
                    'checked' => true,
                ],
                [
                    'number' => 17,
                    'text' => 'Всі мої біди пов’язані з власним невмінням ладнати з людьми',
                    'checked' => true,
                ],
                [
                    'number' => 18,
                    'text' => 'Мене часто приваблюють галасливі компанії',
                    'checked' => true,
                ],
                [
                    'number' => 19,
                    'text' => 'Важливі рішення я завжди приймаю самостійно',
                    'checked' => true,
                ],
                [
                    'number' => 20,
                    'text' => 'Мені завжди приємно знайомитися з новими людьми',
                    'checked' => true,
                ],
                [
                    'number' => 21,
                    'text' => 'Беручись за будь-яку справу, я не стану довго роздумувати, перш ніж почати діяти',
                    'checked' => true,
                ],
                [
                    'number' => 22,
                    'text' => 'Мене дратують люди, які намагаються змінити мою думку, коли я впевнений (впевнена) в своїй правоті',
                    'checked' => true,
                ],
                [
                    'number' => 23,
                    'text' => 'Я часто хвилююся за близьких мені людей, навіть без серйозних причин',
                    'checked' => true,
                ],
                [
                    'number' => 24,
                    'text' => 'Для мене нестерпно, коли хто-небудь змінює встановлений мною порядок',
                    'checked' => true,
                ],
                [
                    'number' => 25,
                    'text' => 'Я вмію привертати до себе увагу оточуючих мене людей',
                    'checked' => true,
                ],
                [
                    'number' => 26,
                    'text' => 'В житті я твердо дотримуюся певних принципів',
                    'checked' => true,
                ],
                [
                    'number' => 27,
                    'text' => 'Люблю відвідувати компанії, де можна танцювати або співати',
                    'checked' => true,
                ],
                [
                    'number' => 28,
                    'text' => 'Я надзвичайно чутливий (чутлива) до змін у настрої оточуючих',
                    'checked' => true,
                ],
                [
                    'number' => 29,
                    'text' => 'Я можу, не бентежачись, пустувати у веселій компанії',
                    'checked' => true,
                ],
                [
                    'number' => 30,
                    'text' => 'Я спокійно ставлюся до того, що хтось поруч переживає з приводу своїх негараздів',
                    'checked' => true,
                ],
                [
                    'number' => 31,
                    'text' => 'Я ніколи поводжусь як егоїст (егоїстка)',
                    'checked' => true,
                ],
                [
                    'number' => 32,
                    'text' => 'Часто трапляється, що через мене у оточуючих псується настрій',
                    'checked' => true,
                ],
                [
                    'number' => 33,
                    'text' => 'Цікаві ідеї виникають у мене частіше, коли я один (одна), а не серед багатьох людей',
                    'checked' => true,
                ],
                [
                    'number' => 34,
                    'text' => 'Я можу взяти на себе відповідальність за цілу групу людей заради користі справи',
                    'checked' => true,
                ],
                [
                    'number' => 35,
                    'text' => 'Мені важко подолати сором’язливість, коли потрібно говорити перед групою людей',
                    'checked' => true,
                ],
                [
                    'number' => 36,
                    'text' => 'Думка старших за віком або вищих за статусом не має для мене особливого значення',
                    'checked' => true,
                ],
                [
                    'number' => 37,
                    'text' => 'Мені не важко змусити інших людей діяти так, як я вважаю за потрібне',
                    'checked' => true,
                ],
                [
                    'number' => 38,
                    'text' => 'Я так сильно переживаю невдачі, що у мене погіршується самопочуття',
                    'checked' => true,
                ],
                [
                    'number' => 39,
                    'text' => 'Я завжди буваю упертий (уперта), коли впевнений (впевнена) в своїй правоті',
                    'checked' => true,
                ],
                [
                    'number' => 40,
                    'text' => 'Якщо в компанії я не перебуваю в центрі уваги, мені стає нудно і нецікаво',
                    'checked' => true,
                ],
                [
                    'number' => 41,
                    'text' => 'Ніхто не може нав’язати мені свою думку',
                    'checked' => true,
                ],
                [
                    'number' => 42,
                    'text' => 'Мені подобається подорожувати з різними, кожен раз новими, попутниками',
                    'checked' => true,
                ],
                [
                    'number' => 43,
                    'text' => 'Я можу змінити свою думку під тиском оточуючих',
                    'checked' => true,
                ],
                [
                    'number' => 44,
                    'text' => 'У поїзді я із задоволенням спілкуюся з попутниками',
                    'checked' => true,
                ],
                [
                    'number' => 45,
                    'text' => 'Я ніколи не обманюю',
                    'checked' => true,
                ],
                [
                    'number' => 46,
                    'text' => 'Я ніколи не відкладаю на завтра те, що слід було зробити сьогодні',
                    'checked' => true,
                ],
                [
                    'number' => 47,
                    'text' => 'Я завжди всім незадоволений (незадоволена)',
                    'checked' => true,
                ],
                [
                    'number' => 48,
                    'text' => 'Я люблю самотність, це дозволяє мені зосередитися на своїх думках',
                    'checked' => true,
                ],
                [
                    'number' => 49,
                    'text' => 'Я вмію зацікавити людей і повести їх за собою',
                    'checked' => true,
                ],
                [
                    'number' => 50,
                    'text' => 'Мені подобається командувати іншими',
                    'checked' => true,
                ],
                [
                    'number' => 51,
                    'text' => 'Я вмію дати відсіч тим, хто втручається в мої справи',
                    'checked' => true,
                ],
                [
                    'number' => 52,
                    'text' => 'Мені інколи ніяково за висловлювання і вчинки моїх близьких',
                    'checked' => true,
                ],
                [
                    'number' => 53,
                    'text' => 'Мені нерідко доводилося в бійці відстоювати свої права',
                    'checked' => true,
                ],
                [
                    'number' => 54,
                    'text' => 'Я відчуваю провину (або навіть сором), якщо мене переслідують невдачі',
                    'checked' => true,
                ],
                [
                    'number' => 55,
                    'text' => 'Мій настрій суттєво залежить від настрою тих, хто мене оточує',
                    'checked' => true,
                ],
                [
                    'number' => 56,
                    'text' => 'Я домагаюся свого завзятістю і наполегливістю',
                    'checked' => true,
                ],
                [
                    'number' => 57,
                    'text' => 'Мені часто буває нудно, коли навколо всі веселяться',
                    'checked' => true,
                ],
                [
                    'number' => 58,
                    'text' => 'Мій сумний настрій легко змінюється, якщо я дивлюся комедійну програму',
                    'checked' => true,
                ],
                [
                    'number' => 59,
                    'text' => 'Заради збереження добрих стосунків я можу відмовитися від своїх намірів',
                    'checked' => true,
                ],
                [
                    'number' => 60,
                    'text' => 'Я завжди дотримуюся загальноприйнятих правил поведінки',
                    'checked' => true,
                ],
                [
                    'number' => 61,
                    'text' => 'Мене люблять усі мої друзі',
                    'checked' => true,
                ],
                [
                    'number' => 62,
                    'text' => 'У мене трагічна доля',
                    'checked' => true,
                ],
                [
                    'number' => 63,
                    'text' => 'У мене багато близьких друзів',
                    'checked' => true,
                ],
                [
                    'number' => 64,
                    'text' => 'Я найнещасніша людина на світі',
                    'checked' => true,
                ],
                [
                    'number' => 65,
                    'text' => 'Мені простіше сподіватися на інших, ніж брати на себе відповідальність, навіть якщо мова йде про мої проблеми',
                    'checked' => true,
                ],
                [
                    'number' => 66,
                    'text' => 'Я намагаюся бути таким (такою), як всі, не виділятися серед інших',
                    'checked' => true,
                ],
                [
                    'number' => 67,
                    'text' => 'Я людина спокійна, врівноважена',
                    'checked' => true,
                ],
                [
                    'number' => 68,
                    'text' => 'Я можу довго не реагувати на чиїсь жарти, однак потім вибухнути гнівною реакцією',
                    'checked' => true,
                ],
                [
                    'number' => 69,
                    'text' => 'Я дуже чутливий (чутлива) до змін погоди',
                    'checked' => true,
                ],
                [
                    'number' => 70,
                    'text' => 'Я не люблю галасливих вечірок',
                    'checked' => true,
                ],
                [
                    'number' => 71,
                    'text' => 'Я можу проявити недбалість у справах, а потім потроху приводити їх до ладу',
                    'checked' => true,
                ],
                [
                    'number' => 72,
                    'text' => 'Я люблю ходити в гості',
                    'checked' => true,
                ],
                [
                    'number' => 73,
                    'text' => 'Мені все одно, що про мене думають інші',
                    'checked' => true,
                ],
                [
                    'number' => 74,
                    'text' => 'Я хвилююся тільки з приводу дуже великих неприємностей',
                    'checked' => true,
                ],
                [
                    'number' => 75,
                    'text' => 'Я ніколи не відчуваю бажання вилаятися',
                    'checked' => true,
                ],
                [
                    'number' => 76,
                    'text' => 'Я нікого ніколи не обманював (не обманювала)',
                    'checked' => true,
                ],
                [
                    'number' => 77,
                    'text' => 'Мені ніхто не потрібен, і я не потрібен (не потрібна) нікому',
                    'checked' => true,
                ],
                [
                    'number' => 78,
                    'text' => 'Я людина сором’язлива',
                    'checked' => true,
                ],
                [
                    'number' => 79,
                    'text' => 'Мені страшенно не щастить у житті',
                    'checked' => true,
                ],
                [
                    'number' => 80,
                    'text' => 'Я часто намагаюся прислухатися до порад більш авторитетної людини',
                    'checked' => true,
                ],
                [
                    'number' => 81,
                    'text' => 'Я б дуже переживав (переживала), якби когось зачепив (зачепила) або образив (образила)',
                    'checked' => true,
                ],
                [
                    'number' => 82,
                    'text' => 'Мене нічим не злякати',
                    'checked' => true,
                ],
                [
                    'number' => 83,
                    'text' => 'Я часто користуюся чужими порадами при вирішенні своїх проблем',
                    'checked' => true,
                ],
                [
                    'number' => 84,
                    'text' => 'У своїх невдачах я, насамперед, звинувачую самого (саму) себе',
                    'checked' => true,
                ],
                [
                    'number' => 85,
                    'text' => 'Я абсолютно не звертаю уваги на свій стиль одягу',
                    'checked' => true,
                ],
                [
                    'number' => 86,
                    'text' => 'Я не намагаюся планувати своє найближче майбутнє і роботу',
                    'checked' => true,
                ],
                [
                    'number' => 87,
                    'text' => 'Коли мене кличуть у гості, я найчастіше думаю: «Краще б мені залишитися вдома»',
                    'checked' => true,
                ],
                [
                    'number' => 88,
                    'text' => 'Я нічого не знаю про особисті проблеми оточуючих мене людей',
                    'checked' => true,
                ],
                [
                    'number' => 89,
                    'text' => 'Найменша невдача різко погіршує мій настрій',
                    'checked' => true,
                ],
                [
                    'number' => 90,
                    'text' => 'Я ніколи не серджуся',
                    'checked' => true,
                ],
                [
                    'number' => 91,
                    'text' => 'Я відповів (відповіла) на всі запитання дуже правдиво',
                    'checked' => true,
                ],
            ],
            'shmisheka' => [
                [
                    'number' => 1,
                    'text' => 'У Вас часто веселий і безтурботний настрій?',
                    'checked' => true,
                ],
                [
                    'number' => 2,
                    'text' => 'Ви чутливі до образ?',
                    'checked' => true,
                ],
                [
                    'number' => 3,
                    'text' => 'Чи трапляється, що у Вас на очі навертаються сльози в кіно, театрі, у бесіді тощо?',
                    'checked' => true,
                ],
                [
                    'number' => 4,
                    'text' => 'Зробивши щось, Ви сумніваєтеся, чи все зроблено правильно, і не заспокоюєтеся доти, доки не переконаєтеся в цьому?',
                    'checked' => true,
                ],
                [
                    'number' => 5,
                    'text' => 'У дитинстві Ви були таким же відчайдушним і сміливим, як усі Ваші однолітки?',
                    'checked' => true,
                ],
                [
                    'number' => 6,
                    'text' => 'Чи часто у Вас трапляються різкі зміни настрою?',
                    'checked' => true,
                ],
                [
                    'number' => 7,
                    'text' => 'У компанії Ви, зазвичай, знаходитеся у центрі уваги?',
                    'checked' => true,
                ],
                [
                    'number' => 8,
                    'text' => 'Чи трапляється, що Ви безпричинно знаходитеся в такому буркотливому настрої, що з Вами краще не розмовляти?',
                    'checked' => true,
                ],
                [
                    'number' => 9,
                    'text' => 'Ви серйозна людина?',
                    'checked' => true,
                ],
                [
                    'number' => 10,
                    'text' => 'Чи здатні Ви сильно захоплюватися чим-небудь?',
                    'checked' => true,
                ],
                [
                    'number' => 11,
                    'text' => 'Ви заповзята людина?',
                    'checked' => true,
                ],
                [
                    'number' => 12,
                    'text' => 'Чи швидко Ви забуваєте, якщо Вас хтось образить?',
                    'checked' => true,
                ],
                [
                    'number' => 13,
                    'text' => 'Чи м’якосерді Ви?',
                    'checked' => true,
                ],
                [
                    'number' => 14,
                    'text' => 'Опускаючи лист у поштову скриньку, Ви перевіряєте, чи він упав?',
                    'checked' => true,
                ],
                [
                    'number' => 15,
                    'text' => 'Чи прагнете Ви бути серед найкращих працівників?',
                    'checked' => true,
                ],
                [
                    'number' => 16,
                    'text' => 'Чи боялися Ви у дитинстві грози або собак, а може, таке трапляється і тепер?',
                    'checked' => true,
                ],
                [
                    'number' => 17,
                    'text' => 'Чи прагнете Ви в усьому й усюди зберігати порядок?',
                    'checked' => true,
                ],
                [
                    'number' => 18,
                    'text' => 'Чи залежить Ваш настрій від зовнішніх обставин?',
                    'checked' => true,
                ],
                [
                    'number' => 19,
                    'text' => 'Чи добре до Вас ставляться Ваші знайомі?',
                    'checked' => true,
                ],
                [
                    'number' => 20,
                    'text' => 'У Вас часто виникає почуття сильного внутрішнього занепокоєння, відчуття можливого лиха, неприємності?',
                    'checked' => true,
                ],
                [
                    'number' => 21,
                    'text' => 'У Вас часто виникає пригнічений настрій?',
                    'checked' => true,
                ],
                [
                    'number' => 22,
                    'text' => 'Чи траплялися у Вас істерики чи нервові зриви?',
                    'checked' => true,
                ],
                [
                    'number' => 23,
                    'text' => 'Чи важко Вам усидіти на одному місці?',
                    'checked' => true,
                ],
                [
                    'number' => 24,
                    'text' => 'Якщо стосовно Вас несправедливо вчинили, чи енергійно Ви відстоюєте свої інтереси?',
                    'checked' => true,
                ],
                [
                    'number' => 25,
                    'text' => 'Чи можете Ви зарізати курку або вівцю?',
                    'checked' => true,
                ],
                [
                    'number' => 26,
                    'text' => 'Вас дратує, якщо завіса чи скатертина висять нерівно, чи намагаєтеся Ви їх поправити?',
                    'checked' => true,
                ],
                [
                    'number' => 27,
                    'text' => 'У дитинстві Ви боялися залишатися вдома на самоті?',
                    'checked' => true,
                ],
                [
                    'number' => 28,
                    'text' => 'Чи часто у Вас безпричинно змінюється настрій?',
                    'checked' => true,
                ],
                [
                    'number' => 29,
                    'text' => 'Чи завжди Ви прагнете бути найкращим фахівцем у своїй справі?',
                    'checked' => true,
                ],
                [
                    'number' => 30,
                    'text' => 'Ви швидко впадаєте в гнів?',
                    'checked' => true,
                ],
                [
                    'number' => 31,
                    'text' => 'Чи здатні Ви бути безтурботно-веселим?',
                    'checked' => true,
                ],
                [
                    'number' => 32,
                    'text' => 'Чи трапляється, що відчуття повного щастя буквально пронизує Вас?',
                    'checked' => true,
                ],
                [
                    'number' => 33,
                    'text' => 'Чи змогли б Ви бути конферансьє?',
                    'checked' => true,
                ],
                [
                    'number' => 34,
                    'text' => 'Ви зазвичай висловлюєте свою думку відверто і недвозначно?',
                    'checked' => true,
                ],
                [
                    'number' => 35,
                    'text' => 'Вам важко переносити вид крові?',
                    'checked' => true,
                ],
                [
                    'number' => 36,
                    'text' => 'Чи подобається Вам робота, де необхідна висока особиста відповідальність?',
                    'checked' => true,
                ],
                [
                    'number' => 37,
                    'text' => 'Чи захищаєте Ви тих, хто зазнав несправедливого поводження?',
                    'checked' => true,
                ],
                [
                    'number' => 38,
                    'text' => 'Вам страшно спуститися в темний підвал?',
                    'checked' => true,
                ],
                [
                    'number' => 39,
                    'text' => 'Чи подобається Вам робота, що потребує швидких, хоча й не обов’язково точних дій?',
                    'checked' => true,
                ],
                [
                    'number' => 40,
                    'text' => 'Чи товариська Ви людина?',
                    'checked' => true,
                ],
                [
                    'number' => 41,
                    'text' => 'В школі Ви охоче декламували вірші?',
                    'checked' => true,
                ],
                [
                    'number' => 42,
                    'text' => 'Чи тікали Ви в дитинстві з дому?',
                    'checked' => true,
                ],
                [
                    'number' => 43,
                    'text' => 'Чи здається Вам життя важким?',
                    'checked' => true,
                ],
                [
                    'number' => 44,
                    'text' => 'Чи траплялося, що після конфлікту чи образи Ви були до того засмучені, що не могли виконувати роботу?',
                    'checked' => true,
                ],
                [
                    'number' => 45,
                    'text' => 'Чи можна сказати, що при невдачі Ви не втрачаєте почуття гумору?',
                    'checked' => true,
                ],
                [
                    'number' => 46,
                    'text' => 'Чи робите Ви першим кроки до примирення, якщо Вас хто-небудь образив?',
                    'checked' => true,
                ],
                [
                    'number' => 47,
                    'text' => 'Ви дуже любите тварин?',
                    'checked' => true,
                ],
                [
                    'number' => 48,
                    'text' => 'Чи повертаєтеся Ви, щоб переконатися, що залишили будинок чи робоче місце в порядку?',
                    'checked' => true,
                ],
                [
                    'number' => 49,
                    'text' => 'Чи турбують Вас думки про те, що з Вами або Вашими близькими має трапитися щось страшне?',
                    'checked' => true,
                ],
                [
                    'number' => 50,
                    'text' => 'Ваш настрій змінюється залежно від погоди?',
                    'checked' => true,
                ],
                [
                    'number' => 51,
                    'text' => 'Чи важко Вам виступати перед великою аудиторією?',
                    'checked' => true,
                ],
                [
                    'number' => 52,
                    'text' => 'Чи можете Ви вдарити кривдника, якщо він Вас образить?',
                    'checked' => true,
                ],
                [
                    'number' => 53,
                    'text' => 'У Вас велика потреба в спілкуванні з іншими людьми?',
                    'checked' => true,
                ],
                [
                    'number' => 54,
                    'text' => 'При розчаруванні Ви можете впасти у відчай?',
                    'checked' => true,
                ],
                [
                    'number' => 55,
                    'text' => 'Вам подобається робота організаційного характеру?',
                    'checked' => true,
                ],
                [
                    'number' => 56,
                    'text' => 'Чи наполегливі Ви у досягненні мети, якщо на шляху до неї багато перешкод?',
                    'checked' => true,
                ],
                [
                    'number' => 57,
                    'text' => 'Чи може трагічний фільм схвилювати Вас до сліз?',
                    'checked' => true,
                ],
                [
                    'number' => 58,
                    'text' => 'Чи часто трапляється, що думки про те що сталося чи має статися заважають Вам заснути?',
                    'checked' => true,
                ],
                [
                    'number' => 59,
                    'text' => 'У школі Ви підказували чи давали списувати своїм товаришам?',
                    'checked' => true,
                ],
                [
                    'number' => 60,
                    'text' => 'Чи дуже страшно Вам пройти уночі через цвинтар?',
                    'checked' => true,
                ],
                [
                    'number' => 61,
                    'text' => 'Чи ретельно Ви стежите за тим, щоб кожна річ у Вашій квартирі знаходилася на своєму місці?',
                    'checked' => true,
                ],
                [
                    'number' => 62,
                    'text' => 'Чи трапляється, що перед сном у Вас гарний настрій, а вранці Ви прокидаєтеся знесиленим і пригніченим?',
                    'checked' => true,
                ],
                [
                    'number' => 63,
                    'text' => 'Чи легко Ви пристосовуєтеся до нових ситуацій?',
                    'checked' => true,
                ],
                [
                    'number' => 64,
                    'text' => 'Чи схильні Ви до головного болю?',
                    'checked' => true,
                ],
                [
                    'number' => 65,
                    'text' => 'Ви часто смієтеся?',
                    'checked' => true,
                ],
                [
                    'number' => 66,
                    'text' => 'Чи можете Ви бути привітним з неприємною людиною настільки, щоб вона не здогадалася про Ваше справжнє ставлення?',
                    'checked' => true,
                ],
                [
                    'number' => 67,
                    'text' => 'Ви енергійна людина?',
                    'checked' => true,
                ],
                [
                    'number' => 68,
                    'text' => 'Ви дуже гостро сприймаєте випадки несправедливості?',
                    'checked' => true,
                ],
                [
                    'number' => 69,
                    'text' => 'Ви пристрасний любитель природи?',
                    'checked' => true,
                ],
                [
                    'number' => 70,
                    'text' => 'Ідучи з дому чи лягаючи спати, Ви перевіряєте, чи зачинені двері, вимкнене скрізь світло?',
                    'checked' => true,
                ],
                [
                    'number' => 71,
                    'text' => 'Ви полохлива людина?',
                    'checked' => true,
                ],
                [
                    'number' => 72,
                    'text' => 'При споживанні алкоголю Ваш настрій змінюється?',
                    'checked' => true,
                ],
                [
                    'number' => 73,
                    'text' => 'Чи подобається Вам брати участь у художній самодіяльності?',
                    'checked' => true,
                ],
                [
                    'number' => 74,
                    'text' => 'Ви сприймаєте майбутнє песимістично?',
                    'checked' => true,
                ],
                [
                    'number' => 75,
                    'text' => 'Чи часто у Вас виникає бажання покинути всі справи і поїхати далеко від дому?',
                    'checked' => true,
                ],
                [
                    'number' => 76,
                    'text' => 'Чи може Ваш настрій раптово змінитися від радості до глибокого смутку?',
                    'checked' => true,
                ],
                [
                    'number' => 77,
                    'text' => 'Чи легко Вам удається підняти настрій у оточуючих?',
                    'checked' => true,
                ],
                [
                    'number' => 78,
                    'text' => 'Чи довго Ви переживаєте образу?',
                    'checked' => true,
                ],
                [
                    'number' => 79,
                    'text' => 'Ви довго переживаєте прикрощі інших людей?',
                    'checked' => true,
                ],
                [
                    'number' => 80,
                    'text' => 'Чи часто у школі Ви переписували сторінку зошита через виправлення?',
                    'checked' => true,
                ],
                [
                    'number' => 81,
                    'text' => 'Чи ставитеся Ви до людей скоріше з обережністю, ніж довірливо?',
                    'checked' => true,
                ],
                [
                    'number' => 82,
                    'text' => 'Чи часто Ви бачите страшні сни?',
                    'checked' => true,
                ],
                [
                    'number' => 83,
                    'text' => 'Чи виникало у Вас занепокоєння, що Ви можете кинутися під колеса потягу чи вистрибнути з вікна?',
                    'checked' => true,
                ],
                [
                    'number' => 84,
                    'text' => 'У веселій компанії Ви зазвичай веселі?',
                    'checked' => true,
                ],
                [
                    'number' => 85,
                    'text' => 'Чи легко Ви можете відволіктися від обтяжливих думок або проблем?',
                    'checked' => true,
                ],
                [
                    'number' => 86,
                    'text' => 'Чи здійснюєте Ви під впливом алкоголю імпульсивні вчинки?',
                    'checked' => true,
                ],
                [
                    'number' => 87,
                    'text' => 'У бесіді Ви більше слухаєте, ніж говорите?',
                    'checked' => true,
                ],
                [
                    'number' => 88,
                    'text' => 'Чи змогли б Ви так увійти в роль, щоб забути про те, що це тільки гра?',
                    'checked' => true,
                ],
            ],
        ];
    }

    /**
     * @param string $scoringMethod
     *
     * @return bool
     */
    public function useWeight($scoringMethod)
    {
        return !in_array($scoringMethod, self::$methodWithoutWeight);
    }
}

/**
 * Checks file/image access for multirowswitch questions.
 *
 * @param stdClass $course course object
 * @param stdClass $cm course module object
 * @param stdClass $context context object
 * @param string $filearea file area
 * @param array $args extra arguments
 * @param bool $forcedownload whether or not force download
 * @param array $options additional options affecting the file serving
 *
 * @return bool
 * @category files
 *
 */
function qtype_multirowswitch_pluginfile($course, $cm, $context, $filearea, $args, $forcedownload, array $options = [])
{
    global $CFG;
    require_once($CFG->libdir . '/questionlib.php');
    question_pluginfile($course, $context, 'qtype_multirowswitch', $filearea, $args, $forcedownload, $options);
}
