<?php

$string['configlog'] = 'Итоговые показатели профпригодности к служебной деятельности (массовые профессии НПУ)';
$string['pluginname'] = 'Итоговые показатели профпригодности к служебной деятельности (массовые профессии НПУ)';

$string['head1'] = 'Параметри для оцінювання';
$string['head2'] = 'Методики дослідження';
$string['head3'] = 'Шкали оцінювання';
$string['head4'] = 'Поліцейська професія';

$string['recommendation_title'] = 'Рекомендації за основними видами поліцейської діяльності';
