<?php

$string['configlog'] = 'Підсумкові показники професійної придатності за основними видами поліцейської діяльності';
$string['pluginname'] = 'Підсумкові показники професійної придатності за основними видами поліцейської діяльності';

$string['head1'] = 'Параметри для оцінювання';
$string['head2'] = 'Методики дослідження';
$string['head3'] = 'Шкали оцінювання';
$string['head4'] = 'Поліцейська професія';

$string['recommendation_title'] = 'Рекомендації за основними видами поліцейської діяльності';
$string['recommendation_suitable_title'] = 'Рекомендації щодо придатності до поліцейскої діяльності';
