<?php

$string['configlog'] = 'Итоговые показатели профессиональной пригодности по основным видам полицейской деятельности';
$string['pluginname'] = 'Итоговые показатели профессиональной пригодности по основным видам полицейской деятельности';

$string['head1'] = 'Параметры для оценки';
$string['head2'] = 'Методики исследования';
$string['head3'] = 'Шкалы оценки';
$string['head4'] = 'Полицейская профессия';

$string['recommendation_title'] = 'Рекомендации по основным видам полицейской деятельности';
$string['recommendation_suitable_title'] = 'Рекомендации относительно пригодности к полицейского деятельности';
